/**
 * 智能分析 - 配置文件
 * @author hjz
 * @version 2017-06-22
 */
import { createButton } from '@/utils'

export function colConfig(that) {
  return [
    {
      title: '学员姓名',
      key: 1,
      align: 'center',
    },
    {
      title: '学科',
      key: 2,
      align: 'center',
    },
    {
      title: '考试次数',
      key: 3,
      align: 'center',
    },
    {
      title: '考题数',
      key: 4,
      align: 'center',
    },
    {
      title: '错题率',
      key: 5,
      align: 'center',
    },
    {
      title: '平均分',
      key: 6,
      align: 'center',
    },
    {
      title: '操作',
      key: 7,
      align: 'center',
      render: createButton([
        { text: '查看', type: 'primary', click: that.checkStu },
      ]),
    },
  ]
}

export const buffer = [
  {
    1: '王芳',
    2: '【语文】【数学】【英语】',
    3: 5,
    4: 22,
    5: '50%',
    6: 60,
  },
  {
    1: '王芳',
    2: '【语文】【数学】【英语】',
    3: 5,
    4: 22,
    5: '50%',
    6: 60,
  },
  {
    1: '王芳',
    2: '【语文】【数学】【英语】',
    3: 5,
    4: 22,
    5: '50%',
    6: 60,
  },
  {
    1: '王芳',
    2: '【语文】【数学】【英语】',
    3: 5,
    4: 22,
    5: '50%',
    6: 60,
  },
  {
    1: '王芳',
    2: '【语文】【数学】【英语】',
    3: 5,
    4: 22,
    5: '50%',
    6: 60,
  },
  {
    1: '王芳',
    2: '【语文】【数学】【英语】',
    3: 5,
    4: 22,
    5: '50%',
    6: 60,
  },
  {
    1: '王芳',
    2: '【语文】【数学】【英语】',
    3: 5,
    4: 22,
    5: '50%',
    6: 60,
  },
  {
    1: '王芳',
    2: '【语文】【数学】【英语】',
    3: 5,
    4: 22,
    5: '50%',
    6: 60,
  },
  {
    1: '王芳',
    2: '【语文】【数学】【英语】',
    3: 5,
    4: 22,
    5: '50%',
    6: 60,
  },
  {
    1: '王芳',
    2: '【语文】【数学】【英语】',
    3: 5,
    4: 22,
    5: '50%',
    6: 60,
  },
  {
    1: '王芳',
    2: '【语文】【数学】【英语】',
    3: 5,
    4: 22,
    5: '50%',
    6: 60,
  },
]
